In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\jayesh\anaconda3\lib\site-packages (0.23.0)
Requirement already satisfied: python-dateutil>=2.5.0 in c:\users\jayesh\anaconda3\lib\site-packages (from pandas) (2.7.3)
Requirement already satisfied: numpy>=1.9.0 in c:\users\jayesh\anaconda3\lib\site-packages (from pandas) (1.14.3)
Requirement already satisfied: pytz>=2011k in c:\users\jayesh\anaconda3\lib\site-packages (from pandas) (2018.4)
Requirement already satisfied: six>=1.5 in c:\users\jayesh\anaconda3\lib\site-packages (from python-dateutil>=2.5.0->pandas) (1.11.0)

In [2]:
!conda update pandas

Solving environment: ...working... done

# All requested packages already installed.

==> WARNING: A newer version of conda exists. <==
  current version: 4.5.11
  latest version: 4.5.12

Please update conda by running

    $ conda update -n base -c defaults conda

In [2]:
#scalar
import pandas as pd
num = 10
print(pd.Series(num,index= range(num-4),dtype='float32'))

0    10.0
1    10.0
2    10.0
3    10.0
4    10.0
5    10.0
dtype: float32

In [ ]:
#instead of scalar in above example we can also pass list, dictionary or tuple

In [17]:
ser_ = pd.Series(range(11,21),index=range(0,10))
print(ser_.index)
print(ser_.index.values)
print(ser_.values)
#Series slicing
num = 5
print(ser_[:num].index.values,ser_[:num].values)

RangeIndex(start=0, stop=10, step=1)
[0 1 2 3 4 5 6 7 8 9]
[11 12 13 14 15 16 17 18 19 20]
[0 1 2 3 4] [11 12 13 14 15]

In [23]:
#accessing Series elements by labels rather than numerical index
ser_ = pd.Series(range(1,6),index=['a','b','c','d','e'])
print(ser_['a'])
ser1_ = pd.Series(range(1,6),index=['a','b','c','d','f'])
#adding two Series
ser2_ = ser_ + ser1_
print(ser2_)
ser2_.fillna(0,inplace=True)
print(ser2_)

1
a    2.0
b    4.0
c    6.0
d    8.0
e    NaN
f    NaN
dtype: float64
a    2.0
b    4.0
c    6.0
d    8.0
e    0.0
f    0.0
dtype: float64

In [28]:
#Creating a DataFrame using 2D array

df = pd.DataFrame( [ [1,2],[3,4],[5,6] ], columns=['Numbers','Pincodes'] )
df

   Numbers  Pincodes
0        1         2
1        3         4
2        5         6

In [29]:
#How to get a shape i.e number of rows and columns of a DataFrame
#shape is a property of DataFrame object, it returns a tuple in the form (rows, columns)
print("shape of DataFrame is:", df.shape)

shape of DataFrame is: (3, 2)

In [30]:
#How to get the indices assigned to a DataFrame, this is BOLD 0,1 assigned to rows of df DataFrame (ref out[4])
#index is the property of DataFrame which returns a RangeIndex object 
print("indices for DataFrame rows are: ", df.index.values)
print('column names of the dataframe are: ',df.columns.values)
#when you print the type of index as below, it says its a class and where it belongs
print(type(df.index))
print(df.index)

indices for DataFrame rows are:  [0 1 2]
column names of the dataframe are:  ['Numbers' 'Pincodes']
<class 'pandas.core.indexes.range.RangeIndex'>
RangeIndex(start=0, stop=3, step=1)

In [21]:
df_ = pd.read_csv('./data/loan-pred-clean.csv')
#show top 5 rows
df_.head() #to show top n rows use .head(n)

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [41]:
df_.info()
'''
info gives various inferences like total rows 600, total columns 13,column names
non-null entries in each columns, data types of columns, memory usage.
'''

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 600 entries, 0 to 599
Data columns (total 13 columns):
Loan_ID              600 non-null object
Gender               589 non-null object
Married              597 non-null object
Dependents           585 non-null object
Education            600 non-null object
Self_Employed        570 non-null object
ApplicantIncome      600 non-null int64
CoapplicantIncome    600 non-null float64
LoanAmount           578 non-null float64
Loan_Amount_Term     586 non-null float64
Credit_History       551 non-null float64
Property_Area        600 non-null object
Loan_Status          600 non-null object
dtypes: float64(4), int64(1), object(8)
memory usage: 61.0+ KB

'\ninfo gives various inferences like total rows 600, total columns 13,column names\nnon-null entries in each columns, data types of columns, memory usage.\n'

In [45]:
df_.describe() 
#this function gives descriptive statistical inference of the dataframe
#it includes total count, mean, standard deviation, min, max and quartile, median is 
#at 50% quartile

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,600.000000,600.000000,578.000000,586.000000,551.000000
mean,4870.668333,1421.538200,141.865052,342.593857,0.843920
std,3380.099718,1684.082008,76.311156,64.797084,0.363261
min,150.000000,0.000000,9.000000,12.000000,0.000000
25%,2880.500000,0.000000,100.000000,360.000000,1.000000
50%,3768.500000,1188.500000,126.500000,360.000000,1.000000
75%,5704.250000,2253.250000,163.500000,360.000000,1.000000
max,20833.000000,8980.000000,650.000000,480.000000,1.000000

In [120]:
#unique catagories in each columns
print(df_.nunique())
print('*'*50)

#lets see what are the unique values in Dependents columns
print(df_['Dependents'].nunique())
print(df_['Dependents'].unique()) #can only be used on a column and not on dataframe
print('*'*50)

#lets see numbers of NaNs in Dependents column
print(df_['Dependents'].isnull().sum())
print('*'*50)

#lets see counts of various catagories in Dependents column
print(df_['Dependents'].value_counts()) #can only be used on a column

Loan_ID              600
Gender                 2
Married                2
Dependents             4
Education              2
Self_Employed          2
ApplicantIncome      492
CoapplicantIncome    282
LoanAmount           195
Loan_Amount_Term      10
Credit_History         2
Property_Area          3
Loan_Status            2
dtype: int64
**************************************************
4
['0' '1' '2' '3+' nan]
**************************************************
15
**************************************************
0     341
2     100
1      99
3+     45
Name: Dependents, dtype: int64

In [151]:
#lets see what is the index of highest loan amount
max_loan_idx = df_['LoanAmount'].idxmax()
max_loan = np.max(df_['LoanAmount']) #similarly mean and std
print(max_loan)
#index of minimum loan amount
min_loan_idx = df_['LoanAmount'].idxmin()
min_loan = np.min(df_['LoanAmount'])
print(min_loan)
#lets see details of max and min loan amount
print((df_.iloc[[max_loan_idx,min_loan_idx],:]).T)

650.0
9.0
                        128       556
Loan_ID            LP001469  LP002840
Gender                 Male    Female
Married                  No        No
Dependents                0         0
Education          Graduate  Graduate
Self_Employed           Yes        No
ApplicantIncome       20166      2378
CoapplicantIncome         0         0
LoanAmount              650         9
Loan_Amount_Term        480       360
Credit_History          NaN         1
Property_Area         Urban     Urban
Loan_Status               Y         N

In [50]:
df_.isnull().sum()
#number of nulls in each columns

Loan_ID               0
Gender               11
Married               3
Dependents           15
Education             0
Self_Employed        30
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       49
Property_Area         0
Loan_Status           0
dtype: int64

In [131]:
#accessing columns
columns_ = df_.columns
print(columns_)
print('='*50)
print(df_[:5]) #indexing, top 5 rows

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')
==================================================
    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   Male      No          0      Graduate            No
1  LP001003   Male     Yes          1      Graduate            No
2  LP001005   Male     Yes          0      Graduate           Yes
3  LP001006   Male     Yes          0  Not Graduate            No
4  LP001008   Male      No          0      Graduate            No

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
1             4583             1508.0       128.0             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
1             1.0         Rural           N
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y

In [65]:
#accessing data frame columns by labels
print(df_['Loan_ID'].head(6))
print('='*50)
#data type of column elements
print(df_['Loan_ID'].dtype)
print('='*50)
print(type(df_['Loan_ID']))

0    LP001002
1    LP001003
2    LP001005
3    LP001006
4    LP001008
5    LP001011
Name: Loan_ID, dtype: object
==================================================
object
==================================================
<class 'pandas.core.series.Series'>

In [77]:
#creating new columns in data frame
#making deep copy of data frame by .copy()
df1_ = df_.copy()
print(df1_.columns)
df1_['Emi'] = df1_['LoanAmount']/df1_['Loan_Amount_Term']
print(df1_.columns) #see new columns 'Emi' was created
#lets drop the columns we just created
print('='*50)
df1_.drop('Emi',axis=1,inplace=True) 
#axis=1 to drop columns, inplace=True to save permenently
print(df1_.columns)

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')
Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status',
       'Emi'],
      dtype='object')
==================================================
Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [135]:
#index based slicing .iloc 
print('*'*50)
print(df_.iloc[:5,:5])
print('*'*50)
#label based slicing
print(df_.loc[:1,['Loan_ID','Gender']])

**************************************************
    Loan_ID Gender Married Dependents     Education
0  LP001002   Male      No          0      Graduate
1  LP001003   Male     Yes          1      Graduate
2  LP001005   Male     Yes          0      Graduate
3  LP001006   Male     Yes          0  Not Graduate
4  LP001008   Male      No          0      Graduate
**************************************************
    Loan_ID Gender
0  LP001002   Male
1  LP001003   Male

In [109]:
df3_ = pd.DataFrame([[1,2],[3,4]],columns=['A','B'],index=['a','b'])
print(df3_)
print('='*50)
#renaming column labels
df3_.rename(columns={'A':'First','B':'Second'},inplace=True)
print(df3_)
print('='*50)
df3_['ind_col'] = np.array(['r1','r2'],dtype='object')
print(df3_)
print('='*50)
#setting index to 
df3_.set_index('ind_col',inplace=True)
print(df3_)

   A  B
a  1  2
b  3  4
==================================================
   First  Second
a      1       2
b      3       4
==================================================
   First  Second ind_col
a      1       2      r1
b      3       4      r2
==================================================
         First  Second
ind_col
r1           1       2
r2           3       4

In [153]:
print(df_.shape[0])
print(df_.index.notnull().sum()) #this can be used to drop null indexes
#df_.index = df_.index.str.lower() to convert string indexes to lower

600
600

In [22]:
#Filtering data frames based on condition gender=male
df4_ = df_[df_['Gender']=='Male']
print(df4_.head())
print('='*50)

#filtering based on gender = male and Loan_Status = Y
df4_ = df_[(df_['Gender']=='Male') & (df_['Loan_Status']=='Y')]
print(df4_.head())

    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   Male      No          0      Graduate            No
1  LP001003   Male     Yes          1      Graduate            No
2  LP001005   Male     Yes          0      Graduate           Yes
3  LP001006   Male     Yes          0  Not Graduate            No
4  LP001008   Male      No          0      Graduate            No

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
1             4583             1508.0       128.0             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
1             1.0         Rural           N
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y
==================================================
    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   Male      No          0      Graduate            No
2  LP001005   Male     Yes          0      Graduate           Yes
3  LP001006   Male     Yes          0  Not Graduate            No
4  LP001008   Male      No          0      Graduate            No
5  LP001011   Male     Yes          2      Graduate           Yes

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0
5             5417             4196.0       267.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y
5             1.0         Urban           Y

In [23]:
#.apply() method to perform some operation on every element of a column
df4_['Gender'] =df4_['Gender'].apply(lambda x:x.lower() if isinstance(x,str) else None)
print(df4_.head())

    Loan_ID Gender Married Dependents     Education Self_Employed  \
0  LP001002   male      No          0      Graduate            No
2  LP001005   male     Yes          0      Graduate           Yes
3  LP001006   male     Yes          0  Not Graduate            No
4  LP001008   male      No          0      Graduate            No
5  LP001011   male     Yes          2      Graduate           Yes

   ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
0             5849                0.0         NaN             360.0
2             3000                0.0        66.0             360.0
3             2583             2358.0       120.0             360.0
4             6000                0.0       141.0             360.0
5             5417             4196.0       267.0             360.0

   Credit_History Property_Area Loan_Status
0             1.0         Urban           Y
2             1.0         Urban           Y
3             1.0         Urban           Y
4             1.0         Urban           Y
5             1.0         Urban           Y

C:\Users\Jayesh\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [30]:
pok_df = pd.read_csv('./data/pokemon.csv')
type1 = pok_df.groupby('Type 1')[['Speed']].median().sort_values(by='Speed')
print(type1)

          Speed
Type 1
Fairy      45.0
Rock       50.0
Steel      50.0
Grass      58.5
Bug        60.0
Fighting   60.0
Ghost      60.5
Ice        62.0
Poison     62.5
Ground     65.0
Water      65.0
Dark       70.0
Normal     71.0
Fire       78.5
Psychic    80.0
Electric   88.0
Dragon     90.0
Flying    116.0

In [31]:
type2 = pok_df.groupby(['Type 2','Generation']).agg({'Speed':'median','Sp. Atk':'median'})
print(type2)

                     Speed  Sp. Atk
Type 2   Generation
Bug      3            60.0     55.0
         4            65.0     30.0
Dark     1            81.0     70.0
         2            66.0     95.0
         3            65.0     90.0
         4            79.0     65.5
         5            74.0     45.0
         6            80.0    103.0
Dragon   1           100.0    130.0
         2            65.0    130.0
         3           100.0     80.0
         4            90.0    135.0
         5            58.0     65.0
         6            55.0     69.0
Electric 2            67.0     66.0
         5            77.5     89.0
Fairy    1            45.0     85.0
         2            40.0     40.0
         3            50.0     60.0
         4            60.0     70.0
         5            66.0     77.0
         6            75.0     81.0
Fighting 1           100.0    112.0
         2            80.0     40.0
         3            75.0     97.5
         4            85.0     65.0
         5           108.0     83.5
         6            64.0     74.0
Fire     2            95.0    110.0
         3            90.0    150.0
...                    ...      ...
Ice      1            70.0     85.0
         2           115.0     35.0
         4            60.0     92.0
         5            95.0    130.0
         6            52.0     83.0
Normal   6            89.0     91.0
Poison   1            70.0     82.5
         2            40.0     55.0
         3            65.0     75.0
         4            72.5     87.5
         5            47.0     55.0
Psychic  1            40.0    100.0
         2            65.0     90.0
         3            77.5     87.5
         4            28.0     51.5
         5            72.5    134.0
         6            73.0     68.0
Rock     1            32.5     37.5
         2            30.0     65.0
         3            45.0     47.5
         4            40.0     55.0
         5            38.5     59.0
Steel    1            57.5    107.5
         2            65.0     60.0
         4            60.0    111.0
         5            65.0     52.0
Water    1            55.0     77.5
         3            55.0     65.0
         4            78.5     80.0
         6            59.0     57.0

[84 rows x 2 columns]

In [34]:
#instead of reading the results in above format we can use pivot tables
piv_ = pd.pivot_table(pok_df,index='Type 2',columns='Generation', values='Speed')
#aggfunc=mean bydefault in pivot table
print(piv_)

Generation           1           2           3           4          5  \
Type 2
Bug                NaN         NaN   60.000000   65.000000        NaN
Dark         81.000000   66.000000   73.571429   72.000000  77.000000
Dragon      100.000000   65.000000  105.000000   92.500000  64.666667
Electric           NaN   67.000000         NaN         NaN  73.750000
Fairy        51.666667   35.000000   58.750000   60.000000  77.333333
Fighting    100.000000   80.000000   76.250000   92.714286  89.400000
Fire               NaN   91.666667   90.000000   86.000000  72.142857
Flying       91.086957   80.052632   89.714286   78.812500  84.421053
Ghost              NaN         NaN   36.666667  100.500000  47.500000
Grass        27.500000  100.000000   43.200000   61.000000  69.200000
Ground       55.166667   37.750000   48.333333   66.125000  71.500000
Ice          66.666667  115.000000         NaN   68.200000  95.000000
Normal             NaN         NaN         NaN         NaN        NaN
Poison       71.590909   51.666667   65.000000   72.500000  52.200000
Psychic      54.285714   60.000000   81.875000   28.000000  72.500000
Rock         32.500000   23.333333   43.750000   40.000000  38.500000
Steel        57.500000   60.000000         NaN   59.444444  59.500000
Water        56.250000         NaN   50.000000   78.500000        NaN

Generation          6
Type 2
Bug               NaN
Dark        86.666667
Dragon      68.200000
Electric          NaN
Fairy       77.200000
Fighting    64.000000
Fire              NaN
Flying      96.333333
Ghost       50.600000
Grass       59.400000
Ground      86.500000
Ice         52.000000
Normal      89.250000
Poison            NaN
Psychic     74.000000
Rock              NaN
Steel             NaN
Water       54.500000

In [37]:
import numpy as np
df1 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df2 = pd.DataFrame({'product': ['apple', 'orange', 'pine'] * 2,
                    'kilo': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

merged1 = pd.merge(left= df1, right=df2, left_on= ['fruit', 'weight'],right_on= ['product', 'kilo'],
         how='inner', suffixes = ['_left','_right'])
merged1

    fruit weight  price_left product  kilo  price_right
0   apple   high           5   apple  high           13
1   apple   high           6   apple  high           13
2   apple   high           9   apple  high           13
3  orange    low          10  orange   low            5
4  orange    low          13  orange   low            5
5  orange    low          10  orange   low            5

In [47]:
df3 = pd.DataFrame({'fruit': ['apple', 'banana', 'orange'] * 3,
                    'weight': ['high', 'medium', 'low'] * 3,
                    'price': np.random.randint(0, 15, 9)})

df4 = pd.DataFrame({'fruit': ['apple', 'orange', 'pine'] * 2,
                    'weight': ['high', 'low'] * 3,
                    'price': np.random.randint(0, 15, 6)})

# Code starts here
merged = pd.merge(left= df3, right=df4, on= ['fruit','weight'],
         how='inner', suffixes = ['_left','_right'],indicator=True) 
#_merge tracks data source 
merged

    fruit weight  price_left  price_right _merge
0   apple   high           0            3   both
1   apple   high           6            3   both
2   apple   high           2            3   both
3  orange    low           9           11   both
4  orange    low           4           11   both
5  orange    low           5           11   both

In [29]:
#Pandas support multilevel indexing also called hierarchical indexing, which allows efficient selection of subsets of a dataframe
outer_level = ['Jan']*3 + ['Feb']*3
inner_level = ['2016', '2017', '2018']*2
hier_index = list(zip(outer_level, inner_level))
hier_index = pd.MultiIndex.from_tuples(hier_index) #get multi-index from list of tuples
df3 = pd.DataFrame([[1,2,3],[3,4,5], [4,5,6],[1,2,3],[3,4,5], [4,5,6]], index=hier_index, columns=['George Clooney', 'Bradd Pitt', 'Leonardo Dicaprio'])
df3

          George Clooney  Bradd Pitt  Leonardo Dicaprio
Jan 2016               1           2                  3
    2017               3           4                  5
    2018               4           5                  6
Feb 2016               1           2                  3
    2017               3           4                  5
    2018               4           5                  6